Revit 2027 API
StairsPath.ShowUpText Property
 Represents whether show stairs up text or not.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowUpText { get; set; }
Public Property ShowUpText As Boolean
	Get
	Set
public:
property bool ShowUpText {
	bool get ();
	void set (bool value);
}
member ShowUpText : bool with get, set
Property Value
Boolean
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace